In [9]:
import pandas as pd

In [10]:
Dimenciones = {
    'id':[1,2,3,4,5,],
    'Npmbre':['Jorie','Brody','Riccardo','Michail','Ganny'],
    'Carrera': ['Civil','Sistemas','Electrica','Sistemas','Quimica'],
}
df = pd.DataFrame(Dimenciones)
df

   id    Npmbre    Carrera
0   1     Jorie      Civil
1   2     Brody   Sistemas
2   3  Riccardo  Electrica
3   4   Michail   Sistemas
4   5     Ganny    Quimica

In [11]:
Hechos = {
    'id': [1],
    'Catidad de estudiantes aprobaron':[2],
    'Carrera con mas reprobaciones':['Quimica']
}
df2 = pd.DataFrame(Hechos)
df2

   id  Catidad de estudiantes aprobaron Carrera con mas reprobaciones
0   1                                 2                       Quimica

In [12]:
pd.merge(Dimenciones,Hechos how= 'outer', left_index = True, right_index = True)

SyntaxError: invalid syntax (1438950703.py, line 1)

In [13]:
df3_merged = pd.merge(df, df2, how= 'outher')

In [15]:
df3_merged

,id,Npmbre,Carrera,Catidad de estudiantes aprobaron,Carrera con mas reprobaciones
0,1,Jorie,Civil,2,Quimica

In [17]:
df3_merged = pd.merge(df, df2, how= 'left')
df3_merged

,id,Npmbre,Carrera,Catidad de estudiantes aprobaron,Carrera con mas reprobaciones
0,1,Jorie,Civil,2.0,Quimica
1,2,Brody,Sistemas,NaN,NaN
2,3,Riccardo,Electrica,NaN,NaN
3,4,Michail,Sistemas,NaN,NaN
4,5,Ganny,Quimica,NaN,NaN